Revit 2027 API
FabricationConfiguration.GetServiceGUID Method
 Gets the service GUID by its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid GetServiceGUID(
	int serviceId
)
Public Function GetServiceGUID (
	serviceId As Integer
) As Guid
public:
Guid GetServiceGUID(
	int serviceId
)
member GetServiceGUID :
        serviceId : int -> Guid
Parameters
serviceId Int32
 The service identifier.
Return Value
Guid
 The service GUID. Returns empty GUID if not found.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace